title: Suspicious Wget execution piping to Bash
id: 5a4b7f80-085e-4c28-94f3-c5dc96704bb4
status: experimental
description: Detects wget downloading a payload and piping it to bash
author: Fenrir
tags:
    - attack.execution
    - attack.t1059.004
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        commandLine|contains|all: 
            - 'wget '
            - '|'
            - 'bash'
    condition: selection
falsepositives:
    - Legitimate admin scripts
level: high
